{
    "5-2": {
        "Vie": [
            [
                "Reference:",
                "1. Taking the bus; riding the bike: carpooling; renting a car:",
                "walking.",
                "2. I personally like biking best because it's convenient, cheap",
                "and healthy. Riding a bike is easy and I can ride my bike",
                "whenever I need to go somewhere without having to wait for",
                "the bus or worrying about parking. Moreover, riding a bike",
                "can save money because it doesn't need gas. Riding a bike is",
                "also good for health. Thus, it's my favorite option."
            ]
        ]
    },
    "5-3": {
        "Wor": [
            [
                "1. renewal",
                "2. renovating",
                "3. implemented",
                "4. tolerable",
                "5. chaotic",
                "6. subsequent"
            ],
            [
                "1) drop",
                "2) off",
                "3) cutting down on",
                "4) is built upon",
                "5) choke on",
                "6) reserved",
                "7) for"
            ]
        ],
        "Col": [
            [
                "1. urban planning",
                "2. sustainable development",
                "3. favorable environment",
                "4. renewable energy",
                "5. sustainable economy",
                "6. alternative energy"
            ],
            [
                "1) Reference: global",
                "2) Reference: cycle",
                "3) Reference: action",
                "4) Reference: degradation",
                "5) Reference: smart",
                "6) Reference: congestion",
                "7) Reference: bold",
                "8) Reference: docking"
            ]
        ],
        "Voc": [
            [
                "1) Reference: n.tpast participle ULAR APOE",
                "2) Reference: nta. REE",
                "3) Reference: an. KA BABE",
                "4) Reference: a+n. BEX",
                "5) Reference: na. # RCT MAE",
                "6) Reference: a.tpr esent participle B2NM Riz AOL",
                "7) Reference: ata. ET ETE AR",
                "8) Reference: a.tpast cpartviple BEL"
            ]
        ],
        "Lan": [
            [
                "1) Reference: Shocked by the earthquake",
                "2) Reference: the people",
                "3) Reference: surrounded by thunderous applause",
                "4) Reference: the city representatives",
                "5) Reference: Seen from the top of the hill",
                "6) Reference: the park",
                "7) Reference: Encouraged by friends",
                "8) Reference: he",
                "9) Reference: Absorbed in reading",
                "10) Reference: she"
            ]
        ],
        "Ban": [
            [
                "1) sustainable",
                "2) urban",
                "3) exclusively",
                "4) renewable",
                "5) contributes",
                "6) greenhouse",
                "7) innovative",
                "8) vision",
                "9) economic",
                "10) environment"
            ]
        ]
    },
    "5-4": {
        "Sha": [
            [
                "Reference:",
                "Many cities are now facing various transportation problems",
                "and my home city is no exception. The biggest",
                "transportation problem in my city is traffic congestion. I",
                "believe that providing bike-sharing services as well as",
                "making full use of space such as building more overpasses",
                "and subways will help solve the problem. With",
                "easy-to-access bike-sharing services and well-established",
                "public transportation systems, people may reconsider the",
                "way they travel and choose bikes or public transportation to",
                "commute to work, which will ease traffic pressure during the",
                "rush hour and will in turn alleviate environmental pollution.",
                "These steps, by decreasing the number of people who drive",
                "their own cars, will help solve the problem of traffic",
                "congestion."
            ]
        ]
    },
    "5-5": {
        "Vie": [
            [
                "1) Japan",
                "2) government",
                "3) Seniors / seniors",
                "4) families"
            ]
        ]
    },
    "5-6": {
        "Wor": [
            [
                "1. prevalent",
                "2. workforce",
                "3. deficit",
                "4. troublesome",
                "5. implicit"
            ],
            [
                "1. shrug off",
                "2. amagnet",
                "3. conceivable",
                "4. insulated",
                "5. notably"
            ]
        ],
        "Col": [
            [
                "1. depressed profits",
                "2. senior employee",
                "3. Economic growth",
                "4. elderly population / aging population / graying",
                "population / greying population",
                "5. senior citizens"
            ],
            [
                "1. with",
                "2. in",
                "3. in",
                "4. at",
                "5. above"
            ]
        ],
        "Voc": [
            [
                "1. Reference: fe A sth tf ak",
                "2. Reference: AWgPE ill",
                "3. Reference: AB a Fh",
                "4. Reference: Zr (LR iRN",
                "5. Reference: S¢2I|7\" Haig",
                "6. Reference: Zuo(L Fee HA & a"
            ]
        ],
        "Tra": [
            [
                "Reference:",
                "BUSPAR RAR 20, AIRE AEA RMR",
                "PARANA K. AEM Bh. wv",
                "qT ASE AT Oe) PA EE. Rees BTA",
                "PGS ICS ia ES eT A BT eR",
                "DAT RUA"
            ],
            [
                "Reference:",
                "By the end of 2016, 15% of the population in China were",
                "older than 60. The number of the elderly in China is",
                "expected to increase by around 10 million every year. This",
                "poses a challenge for China, since the senior care industry is",
                "not yet fully developed. Apart from that, factors such as the",
                "imbalance of economic development in different regions and",
                "the discrepancy between rural and urban areas are",
                "intertwined, which both compounds and complicates the",
                "senior care needs in China. Therefore, as the aging",
                "population is growing, China has to find suitable solutions to",
                "the senior care problem as soon as possible."
            ]
        ]
    },
    "5-7": {
        "Sha": [
            [
                "Reference:",
                "Hi everyone, do you know that the whole world is getting",
                "older? Have you ever thought about the aging problem in",
                "our country? I didn't think much about it before, but after",
                "doing some research on the issue, I found it important and",
                "worth discussing.",
                "According to a report in 2012, China had been the country",
                "with the largest population of citizens over 65 years old.",
                "Usually big cities are much older compared to the rural areas;",
                "however, with more and more younger people moving to big",
                "cities, many rural areas are left with old people taking care",
                "of the little kids. This makes the aging problem in rural areas",
                "even worse.",
                "The aging problem can pose challenges to society. For",
                "example, with more people getting older, the workforce of",
                "the country will decrease and thus the economic growth will",
                "be hampered. At the same time, the pressure to care for the",
                "old gets increasingly high. Moreover, as more middle-aged",
                "people-from rural areas move to big cities to make money,",
                "the old are left in rural areas with nobody caring for them.",
                "So what can be done to deal with the aging problem?",
                "Various ways of caring for the old should be piloted. First,",
                "setting up seniors’ care centers may be helpful. In the care",
                "center, the elderly can be taken care of by professional care",
                "workers. And they have more chances to communicate with",
                "others. Second, it's important to create more employment",
                "opportunities for middle-aged people in rural areas so that",
                "they can stay in their hometown working and caring for their",
                "parents.",
                "Hopefully these means can help cope with the aging problem",
                "to some extent. That's all. Thank you.",
                "iAssess"
            ]
        ]
    },
    "5-9": {
        "Voc": [
            [
                "A Cc D Cc B"
            ],
            [
                "1. cut down on",
                "2. interrelated",
                "3. statistics",
                "4. insulation",
                "5. workforce"
            ]
        ],
        "Ban": [
            [
                "N E H L A G Cc B J",
                "F"
            ]
        ],
        "Rea": [
            [
                "B Cc A Cc B"
            ]
        ],
        "Tra": [
            [
                "Reference:",
                "Offering opportunities for the elderly to work as well as",
                "engage in volunteering, care and artistic activities can",
                "provide both social and economic benefits and relieve some",
                "of the fiscal pressures related to aging societies. However,",
                "work activities for the elderly do not automatically translate",
                "into social welfare gains. In addition to providing",
                "meaningful and rewarding opportunities, activities should be",
                "adapted to the physical and mental condition of the elderly.",
                "While paid and unpaid work activities are beneficial to",
                "society and the elderly, allowing them to make their own",
                "choice is key."
            ],
            [
                "Reference:",
                "on Rae AB LE ACA RAR, IY I",
                "FRAT R GAA rt st ETA, AD A ce SL pe",
                "PEEL APRA T BLA. flan eT",
                "ALANA, Fy MIEKA aT A. Oa)",
                "RARABR, RARE DNSEREIRE A. EAS Be",
                "LP, FREER BREE AS He — TE, RHE AHURA",
                "AMT, BEE THA"
            ]
        ]
    }
}